if(!window.dictdata)
 var dictdata={};
//dictdata["activitiestypeclassify"]={"1":["代表视察","null"],"2":["专题调研","null"],"3":["参加会议","null"],"4":["执法检查","null"],"5":["学习培训","null"],"6":["建议议案","null"]}
dictdata["activitiestypeclassify"]={"1":["出席人代会","null"],"2":["参加其他会议","null"],"3":["参加学习培训","null"],"4":["提出建议议案等","null"],"5":["开展专题调研","null"],"6":["参加视察","null"]
        ,"7":["参加调研","null"],"8":["参加执法检查","null"] ,"9":["接待选民","null"],"10":["化解矛盾纠纷","null"],"11":["扶弱济困","null"],"12":["办好事、实事","null"],"13":["参加公益慈善事业","null"],"14":["向选民述职","null"],"15":["其他","null"]
}
//dictdata["activitiestypeclassify1"]={
//    "1":["开展专题调研 ","null"],
//    "2":["参加视察","null"],
//    "3":["调研","null"],
//    "4":["执法检查活动","null"],
//    "5":["接待选民","null"],
//    "6":["化解矛盾纠纷","null"],
//    "7":["办好事、实事","null"],
//    "8":["扶弱济困","null"],
//    "9":["参加慈善公益事业","null"],
//    "10":["向选民述职","null"],
//    "11":["其他","null"]
//}
//
//
dictdata["activitiestypeclassify1"]={
    "1":["出席人代会 ","null"],
    "2":["列席常委会","null"],
    "3":["参加其他会议","null"],
    "4":["参加学习培训","null"],
    "5":["其他","null"]
}

dictdata["activitiesdepartment"]={
    "1":["办公室 ","null"],
    "2":["法制工作委员会","null"],
    "3":["财政经济工作委员会","null"],
    "4":["农村工作委员会","null"],
    "5":["教育科学文化卫生工作委员会","null"],
    "6":["选举任免代表联络工作委员会","null"],
    "7":["信访办公室","null"],
    "8":["调研室","null"], 
    "9":["环境与资源保护工作委员会","null"], 
    "10":["代表联络科","null"],
    "11":["法制委员会","null"],
    "12":["财政经济预算委员会","null"],
    "13":["社会建设委员会","null"]
}
