if(!window.dictdata)
 var dictdata={};
dictdata["companytypeeeclassify"]={"1":["第一次会议 ","null"],"2":["第二次会议","null"],"3":["第三次会议","null"],"4":["第四次会议","null"],
    "5":["第五次会议","null"],"6":["第六次会议","null"],"7":["第七次会议","null"],"8":["第八次会议","null"],"9":["第九次会议","null"],
    "10":["第十次会议","null"],"11":["第十一次会议","null"],"12":["第十二次会议","null"],"13":["第十三次会议","null"],"14":["第十四次会议","null"],
    "15":["第十五次会议","null"],"16":["第十六次会议","null"],"17":["第十七次会议","null"],"18":["第十八次会议","null"],"19":["第十九次会议","null"],
    "20":["第二十次会议","null"]
}
