if (!window.dictdata)
    var dictdata = {};
dictdata["paystate"] = {"0": "未支付", "1": "已支付", "2": "审核中", "3": "审核通过", "4": "审核未通过", "5": "支付失败"}
dictdata["paychannel"] = {"1": "支付宝H5", "2": "微信平台", "3": "支付宝WEB", "4": "微信H5"}
dictdata["paysource"] = {"1": "APP", "2": "H5", "3": "Web"}
dictdata["authstate"] = {"0": "未认证", "1": "已认证", "2": "认证中", "3": "认证失败"}
dictdata["editstate"] = {"0": "草稿", "1": "发布", "2": "审核中", "3": "审核失败"}
dictdata["ordertype"] = {"1": "充值", "2": "订单"}
dictdata["sex"] = {"0": "未知", "1": "女", "2": "男"}
dictdata["isdelegate"] = {"1": "人大代表", "2": "机关人员"}
dictdata["userstate"] = {"0": "封号", "1": "正常"}
dictdata["artstate"] = {"0": "草稿", "1": "已发布", "2": "待审核"}
dictdata["auditstate"] = {"0": "待审核", "1": "通过", "2": "未通过"}
dictdata["state"] = {"1": "是", "2": "否"}
dictdata["resumetype"] = {"1": "已填写意见", "0": "未填写意见"}
dictdata["deal"] = {"0": "未交办", "1": "已交办"}
dictdata["resume"] = {"0": "未办复", "1": "已办复"}
dictdata["classify"] = {"1": "作为建议提交", "2": "作为议案提交"}
//dictdata["methoded"]={"1": "交承办单位管理","2":"不交承办单位管理"}
//dictdata["opinioned"]={"1": "电话","2":"邮箱"}
dictdata["deliverytype"] = {"1": "坑口价", "2": "车板价", "3": "到岸价", "4": "平仓价", "5": "库提价", "6": "到库价", "7": "船板价", "8": "过驳价"}
dictdata["fbtype"] = {"1": "改进建议", "2": "其他建议"}
dictdata["finstate"] = {"0": "审核中", "1": "已通过", "2": "未通过", "3": "已完成"}
dictdata["ordertype"] = {"1": "担保支付", "2": "非但保支付"}
dictdata["orderstate"] = {"1": "预付款", "2": "装车付款", "3": "货到付款"}
dictdata["classifyid"] = {"1": "普通用户", "2": "商户", "3": "管理员", "4": "司机"}
dictdata["gztype"] = {"1": "条例", "2": "制度", "3": "办法"}
dictdata["servicetype"] = {"1": "1个月", "2": "3个月", "3": "半年", "4": "一年"}
dictdata["cartype"] = {"1": "载货汽车", "2": "载货小车"};
dictdata["carstate"] = {"1": "休息中", "2": "外出中"};
dictdata["methoded"] = {"1": "交承办单位管理", "2": "其他"}
dictdata["opinioned"] = {"1": "电话", "2": "网络", "3": "其他"}
dictdata["seconded"] = {"1": "可以联名提出", "2": "不能联名提出"}
dictdata["judgment"] = {"0": "未知", "1": "是", "2": "否"}
dictdata["reviewclass"] = {"0": "未分类", "1": "人事福利", "2": "城乡建设"}
dictdata["returnxt"] = {"1": "政府", "2": "其他"}
dictdata["session"] = {"1203": "十二届三次", "1204": "十二届四次", "1205": "十二届五次"}
dictdata["comtype"] = {"0": "未知", "1": "市政府组成部门", "2": "类别二", "3": "类别三"}
dictdata["clan"] = {"0": "无", "1": "中国共产党", "2": "中国国民党革命委员会", "3": "中国民主同盟", "4": "中国民主建国会", "5": "中国民主促进会", "6": "中国农工民主党", "7": "中国致公党", "8": "九三学社", "8": "台湾民主自治同盟"}

dictdata["partytype"] = {"0": "中国共产党", "1": "民主党", "2": "无党派", "3": "共青团", "4": "群众"}

//dictdata["circles"] = {"0": "乡镇人大代表", "1": "平顶山市人大代表", "2": "市人大代表", "3": "省(自治区)人大代表", "4": "全国人大代表"}
dictdata["circles"] = {"0": "全国人大代表", "1": "河南省人大代表", "2": "平顶山市人大代表", "3": "汝州市人大代表", "4": "乡镇人大代表"}

dictdata["religion"] = {"0": "未知", "1": "佛教", "2": "基督教", "3": "天主教", "4": "伊斯兰教", "5": "道教"}

dictdata["nationid"] = {"0": "未知", "1": "汉族", "3": "壮族", "4": "满族", "5": "回族", "6": "苗族", "7": "藏族", "8": "维吾尔族", "9": "土家族", "10": "彝族", "11": "蒙古族", "12": "布依族", "13": "侗族", "14": "瑶族", "15": "朝鲜族", "16": "白族", "17": "哈尼族", "18": "哈萨克族", "19": "黎族", "20": "傣族", "21": "畲族", "22": "傈僳族", "23": "仡佬族", "24": "东乡族", "25": "高山族", "26": "拉祜族", "27": "水族", "28": "佤族", "29": "纳西族", "30": "羌族", "31": "土族", "32": "仫佬族", "33": "锡伯族", "34": "柯尔克孜族", "35": "达斡尔族", "36": "景颇族", "37": "瑶族", "38": "撒拉族", "39": "布朗族", "40": "塔吉克族", "41": "阿昌族", "42": "普米族", "43": "鄂温克族", "44": "怒族", "45": "京族", "46": "基诺族", "47": "德昂族", "48": "保安族", "49": "俄罗斯族", "50": "裕固族", "51": "乌孜别克族", "52": "门巴族", "53": "鄂伦春族", "54": "独龙族", "55": "塔塔尔族", "56": "赫哲族", "57": "珞巴族","58":"毛南族"}
dictdata["eduid"] = {"0": "无", "1": "小学", "2": "初中", "3": "高中", "4": "大专", "5": "本科", "6": "研究生", "7": "博士生"}
dictdata["degree"] = {"0": "无", "1": "学士", "2": "硕士", "3": "博士"}
dictdata["comparesign"] = {"=": "=", ">": ">", "<": "<", }
dictdata["linksign"] = {"and": "and", "or": "or"}
dictdata["handle"] = {"0": "未知", "1": "主办/协办", "2": "分办"}
dictdata["registertype"] = {"0": "未知", "1": "立案-作为建议", "2": "立案-作为议案", "3": "其他"}
dictdata["lwstate"] = {"1": "建议", "2": "议案", "3": "批评", "4": "意见", "5": "质询"}
dictdata["importance"] = {"1": "否", "2": "是"}
dictdata["examination"] = {"1": "未审查", "2": "已审查", "5": "初审查", "6": "乡镇政府办已审查", "3": "已置回"}
dictdata["enabled"] = {"1": "启用中", "2": "已禁用"}
dictdata["logstate"] = {"1": "成功", "2": "失败"}
dictdata["logclass"] = {"1": "系统消息", "2": "其他消息"}
dictdata["way"] = {"1": "书面", "2": "平台（上传附件）", "3": "其他"}
dictdata["degreea"] = {"1": "已解决", "2": "正在解决", "3": "列入计划解决", "4": "因条件限制无法解决"}
dictdata["rank"] = {"0": "未知", "1": "非密", "2": "保密"}
dictdata["representative"] = {"1": "同意", "2": "不同意"}
dictdata["draft"] = {"1": "草稿", "2": "已提交"}
dictdata["meet"] = {"1": "会上", "2": "未会上"}
dictdata["permission"] = {"1": "可以网上公开", "2": "禁止网上公开"}
dictdata["noticestate"] = {"1": "是", "2": "否"}

dictdata["publishstate"] = {"1": "否", "2": "是"}

dictdata["infotype"] = {"1": "通知", "2": "公告", "3": "要闻", "4": "法律法规"}
//dictdata["pagesize"]={"10":"10条","15":"15条","20":"20条","30":"30条"}
dictdata["pagesize"] = {"30": "30条", "50": "50条", "100": "100条", "300": "300条", "1000": "1000条"}
dictdata["clueclassify"] = {"1": "分类一", "2": "分类二", "3": "分类三"}
//dictdata["dynamicclass"] = {"1": "工作动态", "2": "代表述职", "3": "活动预告"}
dictdata["dynamicclass"] = {"1": "工作动态", "2": "代表履职", "3": "通知公告", "4": "代表风采"}

dictdata["systemclass"] = {"1": "规章制度", "2": "其他条例"}
dictdata["usertype"] = {"2": "人大代表", "3": "单位", "4": "代表团", "5": "单位联系人", 8: "系统管理员"}
dictdata["txlclassify"] = {"1": "默认分组", "2": "分组一", "3": "分组二", "4": "分组三"}
dictdata["messageclass"] = {"1": "通知", "2": "公告", "3": "要闻", "4": "法律法规", "5": "办复信息", "6": "征询意见", "7": "待审查信息", "8": "待交办信息", "9": "承办信息", "10": "需办复信息已超时", "11": "置回信息", "12": "驳回信息", "13": "已办复信息", "14": "乡镇政府办已审查信息", "15": "初审查信息"}
dictdata["score"] = {"1": "1分", "2": "2分", "3": "3分", "4": "4分", "5": "5分", "6": "6分", "7": "7分", "8": "8分", "9": "9分", "10": "10分"}
dictdata["lectureclassify"] = {"1": "公开讲座", 2: "视频讲座", 3: "其他"}
dictdata["lecturetype"] = {"1": "法规讲座", "2": "规范讲座", "3": "其他讲座"}

dictdata["kejian"] = {"1": "党建", "2": "经济", "3": "履职", "4": "法律法规"}//学习课件


dictdata["demonstration"] = {"1": "普通联络站", "2": "示范联络站"}
//dictdata["stationcontent"] = {"1": "工作动态", "2": "其他动态", "3": "通知公告"}
dictdata["stationcontent"] = {"1": "工作动态", "2": "代表履职", "3": "通知公告",  "4": "代表风采", "5": "法律法规", "6": "专业知识", "7": "资料管理", "8": "代表培训", "9": "矛盾纠纷调处", "10": "民生实事项目",  "11": "代表述职", "12": "活动预告", "13": "办好事、办实事","14": "联络站概况", "16": "图片新闻"}


dictdata["effect"] = {"1": "满意", "2": "基本满意", "3": "不满意"}
//dictdata["activitiestypeclassify"] = {"1": "代表视察活动", "2": "专题调研活动", "3": "代表小组活动", "4": "执法检查活动", "5": "出列席会议", "6": "代表培训", "7": "述职管理"}

//dictdata["activitiestypeclassify"]={"1":["参加视察","null"],"2":["开展专题调研","null"],"3":["参加调研","null"],"4":["参加执法检查","null"],"5":["参加学习培训","null"],"6":["提出建议议案等","null"]
//    ,"7":["出席人代会","null"],"8":["参加其他会议","null"] ,"9":["接待选民","null"],"10":["化解矛盾纠纷","null"],"11":["扶弱济困","null"],"12":["办好事、实事","null"],"13":["参加公益慈善事业","null"],"14":["向选民述职","null"],"15":["其他","null"]
//}

dictdata["activitiestypeclassify"]={"1":["出席人代会","null"],"2":["参加其他会议","null"],"3":["参加学习培训","null"],"4":["提出议案，建议、批评和意见","null"],"5":["开展专题调研","null"],"6":["参加视察、调研及执法检查","null"]
    ,"7":["接待选民","null"],"8":["化解矛盾纠纷","null"] ,"9":["扶弱济困","null"],"10":["办好事、实事","null"],"11":["参加公益慈善事业","null"],"12":["向选民述职","null"],"13":["其他","null"],"14":["向选民述职","null"],"15":["其他","null"]
}


dictdata["activitiesstate"] = {"1": "开启中", "2": "已关闭"}
dictdata["activitiesattendancetype"] = {"1": "未签到", "2": "已签到"}
dictdata["evalyear"] = {"2000": "2000", "2001": "2001", "2002": "2002", "2003": "2003", "2004": "2004", "2005": "2005", "2006": "2006", "2007": "2007", "2008": "2008", "2009": "2009", "2010": "2010", "2011": "2011", "2012": "2012", "2013": "2013", "2014": "2014", "2015": "2015", "2016": "2016", "2017": "2017", "2018": "2018", "2019": "2019", "2020": "2020", "2021": "2021", "2022": "2022", "2023": "2023", "2024": "2024", "2025": "2025", "2026": "2026", "2027": "2027", "2028": "2028", "2029": "2029", "2030": "2030", "2031": "2031", "2032": "2032", "2033": "2033", "2034": "2034", "2035": "2035", "2036": "2036", "2037": "2037", "2038": "2038", "2039": "2039", "2040": "2040", "2041": "2041", "2042": "2042", "2043": "2043", "2044": "2044", "2045": "2045", "2046": "2046", "2047": "2047", "2048": "2048", "2049": "2049", "2050": "2050"}
//dictdata["ssxarea"]={"1":["思恩镇","0"],"2":["水源镇","0"],"3":["洛阳镇","0"],"4":["川山镇","0"],"5":["明伦镇","0"],"6":["东兴镇","0"],"7":["大才乡","0"],"8":["下南乡","0"],"9":["大安乡","0"],"10":["长美乡","0"],"11":["龙岩乡","0"],"12":["驯乐苗族乡","0"],"14":["中山","1"],"15":["叠岭","1"],"16":["陈双","1"],"17":["中兴","1"],"18":["西南","1"],"19":["耐禾","1"],"20":["三乐","1"],"21":["安良","1"],"22":["人和","1"],"23":["清潭","1"],"24":["文化","1"],"25":["福龙","1"],"26":["中涧","2"],"27":["和平","2"],"28":["里腊","2"],"29":["西里","2"],"30":["三才","2"],"31":["三美","2"],"32":["含香","2"],"33":["温平","2"],"37":["文雅","3"],"38":["团结","3"],"39":["普乐","3"],"40":["妙石","3"],"41":["合作","3"],"42":["古昌","3"],"43":["江口","3"],"44":["玉合","3"],"45":["地蒙","3"],"46":["永权","3"],"47":["永安","3"],"48":["雅脉","3"],"49":["琳琅","4"],"50":["同伴","4"],"51":["都川","4"],"52":["古宾","4"],"53":["五圩","4"],"54":["何顿","4"],"55":["杜村","4"],"56":["白丹","4"],"57":["下丰","4"],"58":["下干","4"],"59":["下久","4"],"60":["塘万","4"],"61":["茶江","4"],"62":["雅京","5"],"63":["龙水","5"],"64":["相尧","5"],"65":["豹山","5"],"66":["才帛","5"],"67":["翠山","5"],"68":["百祥","5"],"69":["吉祥","5"],"70":["干城","5"],"71":["北宋","5"],"72":["英豪","5"],"73":["八面","5"],"74":["合狂","5"],"75":["豪洞","5"],"76":["柳平","5"],"77":["为才","6"],"78":["才乐","6"],"79":["加兴","6"],"80":["笃雅","6"],"81":["龙城","6"],"82":["达兴","6"],"83":["久灯","6"],"84":["平安","6"],"85":["标山","6"],"86":["茶山","6"],"87":["同进","7"],"88":["新坡","7"],"89":["大麻","7"],"90":["暧和","7"],"91":["三合","7"],"92":["重楼","7"],"93":["波川","8"],"94":["仪凤","8"],"95":["中南","8"],"96":["古周","8"],"97":["堂八","8"],"98":["玉环","8"],"99":["才门","8"],"100":["下塘","8"],"101":["景阳","8"],"102":["希远","8"],"103":["顶新","9"],"104":["可爱","9"],"105":["才平","9"],"106":["塘房","9"],"107":["环界","9"],"108":["内同","10"],"109":["八福","10"],"110":["内典","10"],"111":["关安","10"],"112":["爱洞","10"],"113":["安山","11"],"114":["达科","11"],"115":["久乐","11"],"116":["良兴","11"],"117":["肯兰","11"],"118":["朝阁","11"],"119":["广荣","11"],"120":["敢岩","11"],"121":["黄种","11"],"122":["达洞","11"],"123":["城皇","11"],"124":["久伟","11"],"125":["平莫","12"],"126":["太平","12"],"127":["全安","12"],"128":["长北","12"],"129":["山岗","12"],"130":["镇北","12"],"131":["康宁","12"],"132":["顺宁","12"]}
//dictdata["ssxarea"] = {"1": ["巴马镇", "0"], "2": ["燕洞镇", "0"], "3": ["甲篆镇", "0"], "4": ["那社乡", "0"], "5": ["所略乡", "0"], "7": ["西山乡", "0"], "8": ["东山乡", "0"], "9": ["凤凰乡", "0"], "10": ["那桃乡", "0"], "11": ["百林乡", "0"], "12": ["巴马", "1"], "13": ["巴发", "1"], "14": ["巴廖", "1"], "15": ["设长", "1"], "16": ["盘阳", "1"], "17": ["法福", "1"], "18": ["练乡", "1"], "19": ["坡腾", "1"], "20": ["巴定", "1"], "21": ["赐福", "1"], "22": ["那坝", "1"], "23": ["龙洪", "1"], "24": ["介莫", "1"], "25": ["元吉", "1"], "26": ["龙甲", "2"], "27": ["交乐", "2"], "28": ["龙凤", "2"], "29": ["龙田", "2"], "30": ["同合", "2"], "31": ["赖满", "2"], "32": ["燕洞", "2"], "33": ["龙威", "2"], "34": ["新力", "2"], "35": ["洪晚", "2"], "36": ["子帽", "2"], "37": ["岩廷", "2"], "38": ["百马", "3"], "39": ["拉高", "3"], "40": ["甲篆", "3"], "41": ["那门", "3"], "42": ["松吉", "3"], "43": ["平安", "3"], "44": ["坡月", "3"], "45": ["民山", "3"], "46": ["仁乡", "3"], "47": ["兴仁", "3"], "48": ["好合", "3"], "49": ["东烈", "4"], "50": ["大洛", "4"], "51": ["那社", "4"], "52": ["公爱", "4"], "53": ["那乙", "4"], "54": ["那勤", "4"], "55": ["祥兰", "4"], "56": ["所圩", "5"], "57": ["坡帮", "5"], "58": ["料乡", "5"], "59": ["甲略", "5"], "60": ["坡晚", "5"], "61": ["福乡", "5"], "62": ["平六", "5"], "63": ["六能", "5"], "64": ["龙凤", "5"], "65": ["尚勤", "5"], "66": ["弄中", "5"], "67": ["百九", "5"], "68": ["弄阳", "5"], "69": ["弄神", "5"], "70": ["局桑", "5"], "71": ["彩乡", "5"], "72": ["力那", "5"], "73": ["浪因", "5"], "74": ["福厚", "7"], "75": ["合乐", "7"], "76": ["巴纳", "7"], "77": ["弄友", "7"], "78": ["加而", "7"], "79": ["干长", "7"], "80": ["拉林", "7"], "81": ["弄京", "7"], "82": ["林览", "7"], "83": ["卡才", "7"], "84": ["弄峰", "7"], "85": ["弄烈", "7"], "86": ["弄林", "7"], "87": ["坡林", "7"], "88": ["勤兰", "7"], "89": ["戈贤", "7"], "90": ["卡桥", "8"], "91": ["江团", "8"], "92": ["优雅", "8"], "93": ["弄谟", "8"], "94": ["三联", "8"], "95": ["文钱", "8"], "96": ["弄山", "8"], "97": ["长垌", "8"], "98": ["长和", "9"], "99": ["德纳", "9"], "100": ["凤凰", "9"], "101": ["那朝", "9"], "102": ["那桃", "10"], "103": ["那敏", "10"], "104": ["兰廷", "10"], "105": ["立德", "10"], "106": ["坡良", "10"], "107": ["民安", "10"], "108": ["班交", "10"], "109": ["平林", "10"], "110": ["阳春", "11"], "111": ["那弄", "11"], "112": ["那莫", "11"], "1113": ["罗皮", "11"], "114": ["平田", "11"]}
//dictdata["ssxarea"] = {"1": ["煤山街道", "1"], "2": ["洗耳河街道", "1"], "3": ["钟楼街道", "1"], "4": ["风穴路街道", "1"], "5": ["紫云路街道", "1"], "7": ["汝南街道", "1"], "8": ["临汝镇", "0"], "9": ["寄料镇", "0"], "10": ["温泉镇", "0"], "11": ["杨楼镇", "0"], "12": ["陵头镇", "0"], "13": ["庙下镇", "0"], "14": ["米庙镇", "0"], "15": ["小屯镇", "0"], "16": ["纸坊镇", "0"], "17": ["蟒川镇", "0"], "18": ["大峪镇", "0"], "19": ["焦村镇", "0"], "20": ["夏店镇", "0"], "21": ["骑岭乡", "0"], "22": ["王寨乡", "0"]}
dictdata["ssxarea"] = {"1": ["煤山街道", "1", "1043"], "2": ["洗耳河街道", "1", "1044"], "3": ["钟楼街道", "1", "1045"], "4": ["风穴路街道", "1", "1042"], "5": ["紫云路街道", "1", "1047"], "7": ["汝南街道", "1", "1046"], "8": ["临汝镇", "0", "1028"], "9": ["寄料镇", "0", "1029"], "10": ["温泉镇", "0", "1030"], "11": ["杨楼镇", "0", "1032"], "12": ["陵头镇", "0", "1034"], "13": ["庙下镇", "0", "1033"], "14": ["米庙镇", "0", "1035"], "15": ["小屯镇", "0", "1027"], "16": ["纸坊镇", "0", "1036"], "17": ["蟒川镇", "0", "1031"], "18": ["大峪镇", "0", "1037"], "19": ["焦村镇", "0", "1039"], "20": ["夏店镇", "0", "1038"], "21": ["骑岭乡", "0", "1040"], "22": ["王寨乡", "0", "1041"]}//dictdata["ssxarea"] = {"1":["临汝镇","0"],"2":["寄料镇","0"],"3":["温泉镇","0"],"4":["杨楼镇","0"],"5":["陵头镇","0"],"6":["庙下镇","0"],"7":["米庙镇","0"],"8":["小屯镇","0"],"9":["纸坊镇","0"],"10":["蟒川镇","0"],"11":["大峪镇","0"],"12":["焦村镇","0"],"13":["夏店镇","0"],"14":["骑岭乡","0"],"15":["王寨乡","0"],"16":["煤山街道","0"],"17":["洗耳河街道","0"],"18":["钟楼街道","0"],"19":["风穴路街道","0"],"20":["紫云路街道","0"],"21":["汝南街道","0"]}
//dictdata["ssxarea"] = {"7": ["临汝镇", "0"], "8": ["寄料镇", "0"], "9": ["温泉镇", "0"], "10": ["杨楼镇", "0"], "11": ["陵头镇", "0"], "12": ["庙下镇", "0"], "13": ["米庙镇", "0"], "14": ["小屯镇", "0"], "15": ["纸坊镇", "0"], "16": ["蟒川镇", "0"], "17": ["大峪镇", "0"], "18": ["焦村镇", "0"], "19": ["夏店镇", "0"], "20": ["骑岭乡", "0"], "21": ["王寨乡", "0"]}



dictdata["supervisiontopicduty"] = {"1": "调研通知", "2": "主送单位调研报告", "3": "调研考察实施", "4": "调研报告", "5": "专题询问", "6": "审议意见", "7": "落实整改方案", "8": "整改落实报告", "9": "整改落实调研", "10": "报告审议"}
dictdata["suptopicstate"] = {"0": "未开始", "1": "进行中", "2": "已完成"}
dictdata["supervisiontopicreceiptstate"] = {"0": "未进行", "1": "待送回", "2": "待审核", "3": "审核通过", "4": "审核未通过"}
dictdata["supervisioninspectionstate"] = {"1": "待送回", "2": "已送回", "5": "已归档"}
dictdata["supervisioninspectiontype"] = {"1": "执法检查", "2": "听取和审议专题报告", "3": "专题询问", "4": "工作评议", "5": "质询和特定问题调查"}
dictdata["supervisiontopicprocessstate"] = {"1": "执法检查", "2": "听取和审议专题报告", "3": "专题询问", "4": "工作评议", "5": "质询和特定问题调查"}
dictdata["meetingtime"] = {"0": "闭会期间", "1": "大会期间"}

dictdata["releasumclassify"] = {"1": "人大要闻", "2": "通知公告", "3": "重要会议", "4": "立法工作", "5": "乡镇人大", "6": "监督工作", "7": "代表工作", "8": "最新公告", "9": "决议决定", "10": "选举任免", "11": "机关建设", "12": "汝州人大电子版", "13": "人大公报", "14": "预算公开", "15": "调查研究", "16": "议案建议","17": "时政新闻","18": "人大代表","19": "人大杂志"}
dictdata["releasummeetid"] = { "1": "人民代表大会会议", "2": "常委会会议", "3": "主任会议"}

dictdata["newsid"] = { "1": "人大要闻", "2": "时政新闻"}
dictdata["financeid"] = { "1": "报告", "2": "预算公开", "3": "预算调整", "4": "视察调研"}

dictdata["releasumclassifys"] = {"1": "人大要闻", "2": "通知公告", "4": "立法工作", "5": "乡镇人大", "6": "监督工作", "7": "代表工作", "8": "最新公告", "9": "决议决定", "10": "选举任免", "11": "机关建设", "12": "汝州人大电子版","13":"公报内容发布","14":"预算公开", "15": "调查研究", "16": "议案建议","17": "时政新闻","18": "人大代表","19": "人大杂志"}
dictdata["releasumstate"] = {"1": "是",  "2": "否"}
dictdata["collectionType"] = {"0": "党史学习",  "1": "学习贯彻中央人大工作会议精神","2": "助力乡村振兴"}
dictdata["contentType"] = {"1": "图片",  "2": "纯文字","3": "标题","4": "大图"}


dictdata["directortype"] = {"1": "主任", "2": "副主任", "3": "常委会党组成员", "4": "秘书长" ,"5": " 常委会委员"}
//dictdata["delegatetype"] = {"1": "省人大代表", "2": "市人大代表", "3": "平顶山人大代表", "4": "乡镇人大代表"}
dictdata["delegatetype"] = {"1": "全国人大代表","2": "河南省人大代表", "3": "汝州市人大代表", "4": "平顶山市人大代表", "5": "乡镇人大代表"}
dictdata["delegation"] = {"1": "小屯镇","2": "寄料镇", "3": "温泉镇", "4": "临汝镇", "5": "蟒川镇","6": "杨楼镇",
    "7": "庙下镇", "8": "陵头镇", "9": "米庙镇", "10": "纸坊镇","11": "大峪镇","12": "夏店镇", "13": "焦村镇", "14": "骑岭乡", "15": "王寨乡",
    "16": "风穴路街道","17": "煤山街道", "18": "洗耳河街道", "19": "钟楼街道", "20": "汝南街道", "21": "紫云路街"}



dictdata["publiclassifyid"] = {"1": "报告", "2": "预算公开", "3": "预算调整", "4": "视察调研"}
dictdata["evaluationstate"] = {"0": "未开始", "1": "进行中", "2": "已结束"}
dictdata["evaluationscorestate"] = {"0": "待评", "1": "已评"}




dictdata["reapetitionclassify"] = {"1": "参政议政", "2": "政策法规", "3": "工作原因", "4": "干部作风", "5": "信访人因素", "6": "自然灾害", "7": "涉外因素", "8": "其他"}
dictdata["petitionclassify"] = {"1": "来信", "2": "来访", "3": "网上来信", "4": "上级转交件"}

dictdata["petitionhandleclassify"] = {"1": "转送", "2": "交办", "3": "告知", "4": "办结"}
dictdata["petitioninformclassify"] = {"1": "告知受理", "2": "不予受理告知（属法院职权范围内）", "3": "不予受理告知（属检察院职权范围内）", "4": "不予受理告知（应当通过诉讼途径）","5":"不予受理告知（应当通过仲裁途径）","6":"不予受理告知（应当通过行政复议途径）","7":"不予受理告知（不属本部门职权范围）"}

dictdata["petitiongtdeparclassify"] = {"1": "法制委员会", "2": "财政经济委员会", "3": "环境与资源保护委员会", "4": "检查和司法委员会", "5": "人命政府", "6": "教育局"}
dictdata["recunitclassify"] = {"1": "市政府办", "2": "东海市人民政府"}

dictdata["questionType"] = {"0":"所有", "1": "单选", "2": "多选", "3": "判断"}
dictdata["questionCategory"] = {"0":"所有", "1": "宪法", "2": "法院组织法","3": "检察官法", "4": "人民检察院组织法", "5": "自治条例及部份地方性法规", "6": "监察法", "7": "组织法", "8": "选举法", "9": "代表法", "10": "自治法", "11": "监督法", "12": "公务员法", "12": "行政诉讼法", "12": "法官法"}

dictdata["questionType1"] = {"1": "单选", "2": "多选", "3": "判断"}
dictdata["questionCategory1"] = {"1": "宪法", "2": "法院组织法","3": "检察官法", "4": "人民检察院组织法", "5": "自治条例及部份地方性法规", "6": "监察法", "7": "组织法", "8": "选举法", "9": "代表法", "10": "自治法", "11": "监督法", "12": "公务员法", "13": "行政诉讼法", "14": "法官法"}

dictdata["category"] = {"1": "政府系统", "2": "人大系统", "3": "监委", "4": "法院", "5": "检察院"}
//dictdata["select"] = {"1": "单选", "2": "多选", "3": "判断", "4": "法院", "5": "检察院"}

//法律法规库
dictdata["timeliness"] = {"1": "现行有效", "2": "尚未生效", "3": "部分有效", "4": "已失效"}
dictdata["Effectivenesslevel"] = {"1": "法律", "2": "行政法规", "3": "规章", "4": "司法解释", "5": "司法指导性文件", "6": "部门规章"}
dictdata["classification"] = {"1": "全国", "2": "国务院", "3": "河南省", "4": "郑州市", "5": "其他"}

//人大决策库系统
dictdata["innovation"] = {"1": "人大制度", "2": "立法研究", "3": "监督研究", "4": "代表工作", "5": "自身建设", "6": "民主政治建设"}
dictdata["trend"] = {"1": "全国动向", "2": "省外动向", "3": "省内动向"}
dictdata["international"] = {"1": "海外会议", "2": "经验参考"}
dictdata["guoqing"] = {"1": "国情", "2": "省情", "3": "市情"}
dictdata["socialhot"] = {"1": "专家观点", "2": "社会舆情"}
dictdata["decisionreference"] = {"1": "领导决策", "2": "信息商报", "3": "专题参阅", "4": "重大议题", "5": "原文参考"}
dictdata["activityreference"] = {"1": "基础知识", "2": "经验交流", "3": "议案建议", "4": "明星代表", "5": "专题习研"}

//重大议题
dictdata["importanttopics_13"] = {"1": "专题一：习近平法治思想引领法治中国建设", "2": "专题二：科学谋划“十四五”发展", "3": "专题三：助力构建“双循环”新发展格局"}//2022两会热点议题
dictdata["importanttopics_12"] = {"1": "专题一：习近平法治思想引领法治中国建设", "2": "专题二：科学谋划“十四五”发展", "3": "专题三：助力构建“双循环”新发展格局"}//2021两会热点议题
dictdata["importanttopics_11"] = {"1": "专题一：全面提升治理现代化水平", "2": "专题三：大力优化法治化营商环境"}//2020两会热点议题
dictdata["importanttopics_10"] = {"1": "专题一：全面提升治理现代化水平", "2": "专题二：大力优化法治化营商环境"} //2019两会热点议题
dictdata["importanttopics_9"] = {"1": "专题一：准确理解学习十九大精神", "2": "专题二：加强大数据发展法制化建设"}//2018两会热点议题
dictdata["importanttopics_8"] = {"1": "继续推进供给侧结构性改革", "2": "构建全面创新改革长效机制"}//2017两会热点议题
dictdata["importanttopics_7"] = {"1": "科学谋划“十三五”发展", "2": "发力供给侧结构性改革", "3": "全面推进大众创业万众创新"}//2016两会热点议题
dictdata["importanttopics_6"] = {"1": "科学谋划“十三五”发展", "2": "发力供给侧结构性改革", "3": "全面推进大众创业万众创新"}
dictdata["importanttopics_5"] = {"1": "专题一：习近平法治思想引领法治中国建设", "2": "专题二：科学谋划“十四五”发展", "3": "专题三：助力构建“双循环”新发展格局"}
dictdata["importanttopics_4"] = {"1": "专题一：习近平法治思想引领法治中国建设", "2": "专题二：科学谋划“十四五”发展", "3": "专题三：助力构建“双循环”新发展格局"}
dictdata["importanttopics_3"] = {"1": "专题一：习近平法治思想引领法治中国建设", "2": "专题二：科学谋划“十四五”发展", "3": "专题三：助力构建“双循环”新发展格局"}
dictdata["importanttopics_2"] = {"1": "专题一：习近平法治思想引领法治中国建设", "2": "专题二：科学谋划“十四五”发展", "3": "专题三：助力构建“双循环”新发展格局"}
dictdata["importanttopics_1"] = {"1": "专题一：习近平法治思想引领法治中国建设", "2": "专题二：科学谋划“十四五”发展", "3": "专题三：助力构建“双循环”新发展格局"}
