if(!window.dictdata)
 var dictdata={};//届次
//dictdata["sessionclassify"]={"11":["巴马瑶族自治县第十五届人民代表大会","null"],"19":["河池市第四届人民代表大会","null"],"20":["广西壮族自治区第十三届人民代表大会","null"],"21":["巴马镇第十二届人民代表大会","null"],"22":["那社乡第十四届人民代表大会","null"]}
//dictdata["sessionclassify"]={"30":["乌兰浩特市第十三届人民代表大会","null"],"32":["乌兰浩特市第十四届人民代表大会","null"]}
dictdata["sessionclassify"]={"30":["汝州市第九届人民代表大会","null"],
    "31":["汝州市第十届人民代表大会","null"],
    "32":["汝州市第十一届人民代表大会","null"],
    "33":["汝州市第十二届人民代表大会","null"],
    "34":["汝州市第十三届人民代表大会","null"],
    "35":["汝州市第十四届人民代表大会","null"],
    "36":["汝州市第十五届人民代表大会","null"],
    "37":["汝州市第十六届人民代表大会","null"]
}
